<!DOCTYPE html>
<html>
<head>
	<title>Manuel Islas</title>
</head>
<body>

<p>- no title specified</p>
<table border="0" cellspacing="0" cellpadding="0"><colgroup><col width="35" /><col width="335" /><col width="250" /></colgroup>
<tbody>
<tr>
<td colspan="3">
<p>Manuel Islas</p>
</td>
</tr>
<tr>
<td>&nbsp;</td>
<td colspan="2">
<p>trentcioran@gmail.com</p>
</td>
</tr>
<tr>
<td colspan="3">&nbsp;</td>
</tr>
<tr>
<td colspan="3">
<p>Historial de empleo</p>
</td>
</tr>
<tr>
<td colspan="2">
<p>Arquitecto de Software</p>
</td>
<td>
<p>&mdash;</p>
</td>
</tr>
<tr>
<td colspan="3">
<p>Global Assurance Brokers</p>
<ul>
<li>
<p>--Oficina virtual para clientes - (Scriptaculous/MS AjaxExtensions/C#3.0), aplicaci&oacute;n dise&ntilde;ada con &eacute;nfasis en la flexibilidad de configuraci&oacute;n, personalizaci&oacute;n y dise&ntilde;o din&aacute;mico de reportes, esto debido a que un requerimiento fue permitir la personalizaci&oacute;n de la imagen del sistema a la imagen corporativa del cliente y la posibilidad de que cada cliente pudiera contar con reportes espec&iacute;ficos.&nbsp;</p>
</li>
<li>
<p>--Cotizador de autos - (ExtJS2.1/Ninject/NHibernate/C#3.0), aplicaci&oacute;n a tres capas intercomunicada con aseguradoras por medio de servicios web para cotizaci&oacute;n y emisi&oacute;n en l&iacute;nea. &nbsp;</p>
</li>
<li>
<p>--Opcionales - Sistema cotizador de GMM (EXTJS2.1/Ninject/NHibernate/C#3.5), aplicaci&oacute;n dise&ntilde;ada con &eacute;nfasis en la flexibilidad de cotizaci&oacute;n. &nbsp;</p>
</li>
<li>
<p>--Consolidaci&oacute;n SAP B1 - Dise&ntilde;o y desarrollo de un proceso (T-SQL) para consolidar las razones sociales que conforman la empresa y as&iacute; poder visualizar la informaci&oacute;n sumarizada de los ingresos contra los egresos de estas en una sola empresa. &nbsp;</p>
</li>
<li>
<p>--Cognitum &nbsp;</p>
</li>
</ul>
<p>An&aacute;lisis, dise&ntilde;o e implementaci&oacute;n, sistema utilizado para la operaci&oacute;n del corredor de seguros, dise&ntilde;o enfocado en la escalabilidad y comercializaci&oacute;n futura utilizando tecnolog&iacute;as ExtJS3 /Ninject/NHibernate/C#3.5.</p>
<p>Utilizando el framework Karma.Core desarrollado por m&iacute;, presenta una interface de programaci&oacute;n uniforme y sencilla que le permite soportar el cambio sin sufrir mayor esfuerzo en mantenimiento.</p>
<p>Por medio del uso de Karma.UI.ExtJS la capa de presentaci&oacute;n muestra una interface sencilla que permite la r&aacute;pida implementaci&oacute;n de nuevas caracter&iacute;sticas para el sistema sin perder flexibilidad.</p>
<p>Interface con Microsoft CRM v3 por medio del mecanismo de flujos con que cuenta CRM para el manejo de la cartera de clientes, al convertirse los prospectos en clientes.</p>
<p>Interface con SAP B1 haciendo uso del API de .Net que expone este mismo, la interface implementa la funcionalidad correspondiente a la facturaci&oacute;n, presupuestos, administraci&oacute;n de solicitudes de vacaciones, impresi&oacute;n de recibos de n&oacute;mina y registro de gastos de ejecutivos.</p>
<p>&nbsp;El dise&ntilde;o est&aacute; dirigido por el dominio (DDD) combinado con un enfoque de metadatos para permitir la flexibilidad requerida combinada con un lenguaje de dominio que permite la correlaci&oacute;n de t&eacute;rminos con el negocio.</p>
<p>Manejo de Exportaci&oacute;n utilizando el API OpenXML de Microsoft y Reportes creados utilizando SQL Server 2008 Reporting Services.</p>
</td>
</tr>
<tr>
<td colspan="2">
<p>Desarrollador Senior Java</p>
</td>
<td>
<p>&mdash;</p>
</td>
</tr>
<tr>
<td colspan="3">
<p>IT Brain</p>
<ul>
<li>
<p>--Santander/JackBe - Proyecto H2H para atenci&oacute;n de clientes preferentes a servicios de pago de nomina, transferencias bancarias e interbancarias (TEF y SPEI), aplicaci&oacute;n dividida en tres bloques: Administraci&oacute;n (Front - aplicaci&oacute;n web EAF), Core (procesamiento batch de archivos y eventos del sistema, y ESB (bloque responsable de la comunicaci&oacute;n con el mainframe) &nbsp;</p>
</li>
</ul>
<p>Arquitectura a tres capas utilizando Java1.5 con EAF(JackBe)/Spring2/Hibernate3(JPA)/jBpm/Quartz/ActiveMQ/Maven utilizando un enfoque dirigido por el dominio (DDD)</p>
<p>Responsable de coordinar los esfuerzos del equipo Core y lead programming, dise&ntilde;o parcial del algoritmo para el procesamiento de los archivos desde su llegada del cliente hasta su envi&oacute; al ESB.</p>
<ul>
<li>
<ul>
<li>
<p>ooRecepci&oacute;n de los archivos/Monitoreo de los repositorios de los clientes&nbsp;</p>
</li>
<li>
<p>ooValidaci&oacute;n de los archivos&nbsp;</p>
</li>
<li>
<p>ooGeneraci&oacute;n de los objetos de dominio y persistencia&nbsp;</p>
</li>
<li>
<p>ooCoordinaci&oacute;n de los flujos correspondientes de acuerdo a los requerimientos de la infraestructura del mainframe&nbsp;</p>
</li>
<li>
<p>ooEnv&iacute;o de transacciones a mainframe&nbsp;</p>
</li>
</ul>
</li>
</ul>
</td>
</tr>
<tr>
<td colspan="2">
<p>Desarrollador Senior Java/.Net</p>
</td>
<td>
<p>&mdash;</p>
</td>
</tr>
<tr>
<td colspan="3">
<p>Grupo CAPSI en Tecnolog&iacute;as de la Informaci&oacute;n</p>
<ul>
<li>
<p>--Sorry Activity (BMW) &ndash; Sistema para el fomento de lealtad de clientes. &nbsp;</p>
<ul>
<li>
<p>ooResponsable de la construcci&oacute;n&nbsp;</p>
</li>
<li>
<p>ooSistema a capas utilizando NHibernate para la capa de persistencia y Asp.Net/AJAX para la presentaci&oacute;n.&nbsp;</p>
</li>
</ul>
</li>
<li>
<p>--GatoradeOnline (Gatorade) - Sistema punto de venta para clientes mayoristas &nbsp;</p>
<ul>
<li>
<p>ooResponsable de la arquitectura y lead programming&nbsp;</p>
</li>
<li>
<p>ooTecnolog&iacute;a Java1.5, JSF/AJAX, Hibernate2, Spring1.2, Maven.&nbsp;</p>
</li>
<li>
<p>ooTres capas &nbsp;</p>
</li>
<li>
<p>ooEnfoque dirigido por el dominio (DDD)&nbsp;</p>
</li>
</ul>
</li>
<li>
<p>--SCAP (The Coca-Cola Export) - Sistema para el c&aacute;lculo de precios del concentrado. Sistema desarrollado utilizando Java 1.4/Struts1.2&nbsp;</p>
</li>
</ul>
<p>Responsabilidades:</p>
<ul>
<li>
<ul>
<li>
<p>ooRescate de la cuenta dado que el proyecto se encontraba con 4 meses de retraso y sin rumbo indefinido.&nbsp;</p>
</li>
<li>
<p>ooSe re implementaron la mayor&iacute;a de los cat&aacute;logos habiendo dise&ntilde;ado un sistema de navegaci&oacute;n gen&eacute;rico con el cual se reutilizaba mucho c&oacute;digo lo cual facilito el mantenimiento y correcci&oacute;n de acuerdo con las peticiones del usuario final.&nbsp;</p>
</li>
<li>
<p>ooSe re implemento el modulo de generaci&oacute;n de formulas, el Editor de Formulas se desarrollo con mootools 100% javascript orientado a objetos y depurado con log4javascript. &nbsp;</p>
</li>
<li>
<p>ooDado que el c&aacute;lculo con Java era muy lento, se dise&ntilde;o e implemento una soluci&oacute;n basada en PLs (stored procedures de Oracle) para el c&aacute;lculo masivo de precios (como dato el sistema anterior desarrollado en power builder tardaba 6-8hrs en realizar este proceso mientras el sistema basado en PLs solo tarda 25 min).&nbsp;</p>
</li>
</ul>
</li>
</ul>
</td>
</tr>
<tr>
<td colspan="2">
<p>Arquitecto de Software Java</p>
</td>
<td>
<p>&mdash;</p>
</td>
</tr>
<tr>
<td colspan="3">
<p>Softtek</p>
<ul>
<li>
<p>--Integrante del equipo de arquitectura como soporte a los proyectos principales del IMSS. &nbsp;</p>
</li>
<li>
<p>--Responsable del dise&ntilde;o e implementaci&oacute;n del modulo de seguridad. El m&oacute;dulo de seguridad deb&iacute;a cumplir con los siguientes requisitos:&nbsp;</p>
<ul>
<li>
<p>ooFuente de datos LDAP (Sun), la fuente con los datos de identidad y permisos del usuario se encuentran almacenados en LDAP para su correcto seccionamiento en regiones, distritos, etc.&nbsp;</p>
</li>
<li>
<p>ooModular e independiente de los tres sistemas (ST, SPES y SA), dado que cada sistema cuenta con su propio framework y su propio modelo de dominio, el modulo debe ser independiente de estos.&nbsp;</p>
</li>
<li>
<p>ooCon una arquitectura de tipo plug-in para que por medio de configuraci&oacute;n sea posible agregarlo a cada sistema sin necesidad de una programaci&oacute;n.&nbsp;</p>
</li>
<li>
<p>ooImplementaci&oacute;n en Java1.4/Struts1.2/Spring1.2/Hibernate2/Maven que es el perfil de las tres aplicaciones.&nbsp;</p>
</li>
</ul>
</li>
<li>
<p>--Co-autor del dise&ntilde;o del componente de Auditoria. Componente responsable de auditar todos los cambios sobre la base de datos en una arquitectura Struts/Spring/Hibernate&nbsp;</p>
</li>
</ul>
</td>
</tr>
<tr>
<td colspan="2">
<p>Desarrollador Senior .Net</p>
</td>
<td>
<p>&mdash;</p>
</td>
</tr>
<tr>
<td colspan="3">
<p>Grupo CAPSI en Tecnolog&iacute;as de la Informaci&oacute;n</p>
<ul>
<li>
<p>--Complaint Management System (BMW). &nbsp;</p>
</li>
</ul>
<p>Colaboraci&oacute;n en el sistema (Visual Basic .Net / C#) para el desarrollo de la interface con el CRM GoldMine, construcci&oacute;n de un sistema motor de servicios autom&aacute;ticos utilizado para escalar las quejas, reportes y estabilizaci&oacute;n del sistema.</p>
<ul>
<li>
<p>--Time Management System (BMW). &nbsp;</p>
</li>
</ul>
<p>Dise&ntilde;o de la arquitectura (C#2.0) en 3 capas utilizando DAOs (Data Access Objects) y factor&iacute;as para el acceso a la base de datos, POCOs, as&iacute; como de un esquema de seguridad basado en Servicios (Roles X Servicios). Implementaci&oacute;n de los m&oacute;dulos de: seguridad (usuarios, roles, configuraci&oacute;n), Cat&aacute;logos, Codificador, Controlador y Reportes (Crystal Reports). Para este sistema se construyo un generador de c&oacute;digo pasivo el cual generaba el c&oacute;digo de los DAOs, Assemblers y POCOs a partir de la base de datos dado que el dise&ntilde;o del modelo era sobre la base de datos con ERwin y con ello agilizar el proceso de construcci&oacute;n.</p>
</td>
</tr>
<tr>
<td colspan="2">
<p>Desarrollador Senior Java</p>
</td>
<td>
<p>&mdash;</p>
</td>
</tr>
<tr>
<td colspan="3">
<p>Centro de Investigaci&oacute;n en C&oacute;mputo</p>
<ul>
<li>
<p>--An&aacute;lisis y dise&ntilde;o del sitio institucional del proyecto Gnoxis para la Comunidad Europea con tecnolog&iacute;a J2EE (Java1.4, EJB2.1, WebServices, JSP, Struts1.1, JXTA). &nbsp;</p>
</li>
<li>
<p>--Coordinaci&oacute;n del equipo de trabajo conformado por 8 desarrolladores y 5 estudiantes de servicio social, as&iacute; como la capacitaci&oacute;n del personal en la plataforma Struts cuando fue necesario. &nbsp;</p>
</li>
<li>
<p>--Curso Programaci&oacute;n XML con el .Net Framework. Impartici&oacute;n del curso de programaci&oacute;n de XML con el .net framework, teor&iacute;a de XML y tecnolog&iacute;as relacionadas (XML, XSD, DTD, Xpath, XSL) e introducci&oacute;n a la programaci&oacute;n con C# a la PROFEDET (Procuradur&iacute;a Federal del Trabajador) &nbsp;</p>
</li>
<li>
<p>--Curso Java Avanzado Curso en el cual se abarcaron temas como swing, jdbc, threads, sockets, servlet y jsp. Impartido a p&uacute;blico general.&nbsp;</p>
</li>
</ul>
</td>
</tr>
<tr>
<td colspan="2">
<p>Desarrollador Junior .Net</p>
</td>
<td>
<p>&mdash;</p>
</td>
</tr>
<tr>
<td colspan="3">
<p>Alexander Forbes</p>
<ul>
<li>
<p>--Administraci&oacute;n de la base de datos NetForbes (operaci&oacute;n) y Solomon (ERP) y soporte t&eacute;cnico a usuarios finales. &nbsp;</p>
</li>
<li>
<p>--Desarrollo de reportes para el sistema Solomon en Crystal Reports 8. &nbsp;</p>
</li>
<li>
<p>--Mantenimiento al sistema de Mensajer&iacute;a (ASP 3.0/VB). &nbsp;</p>
</li>
<li>
<p>--An&aacute;lisis e implementaci&oacute;n de m&oacute;dulos para el sistema NetForbes (Mensajer&iacute;a, Archivo muerto, importador de flotillas de autos, cartas) con Visual Basic 6. &nbsp;</p>
</li>
<li>
<p>--An&aacute;lisis e implementaci&oacute;n del sistema HelpDesk (v1 DHTML/AJAX, v2 ASP.Net) para soporte a la operaci&oacute;n del departamento de sistemas. &nbsp;</p>
</li>
<li>
<p>--An&aacute;lisis e implementaci&oacute;n del sistema para calculo de proyecciones de jubilaciones para el departamento de actuar&iacute;a (C#, T-SQL). &nbsp;</p>
</li>
<li>
<p>--Mantenimiento del m&oacute;dulo de reportes (Asp.Net).&nbsp;</p>
</li>
</ul>
</td>
</tr>
</tbody>
</table>

</body>
</html>